namespace CursoProgressao.Shared.Constants;

public static class RegexPattern
{
    public const string NAME = "^[a-zA-ZáéíóúÁÉÍÓÚàèìòùÀÈÌÒÙâêîôûÂÊÎÔÛãõÃÕçÇ']+$|^[a-zA-ZáéíóúÁÉÍÓÚàèìòùÀÈÌÒÙâêîôûÂÊÎÔÛãõÃÕçÇ']+(?:\\s[a-zA-ZáéíóúÁÉÍÓÚàèìòùÀÈÌÒÙâêîôûÂÊÎÔÛãõÃÕçÇ']*)*[a-zA-ZáéíóúÁÉÍÓÚàèìòùÀÈÌÒÙâêîôûÂÊÎÔÛãõÃÕçÇ']+$|^[a-zA-ZáéíóúÁÉÍÓÚàèìòùÀÈÌÒÙâêîôûÂÊÎÔÛãõÃÕçÇ']+\\s[a-zA-ZáéíóúÁÉÍÓÚàèìòùÀÈÌÒÙâêîôûÂÊÎÔÛãõÃÕçÇ']+$";
    public const string RG = "^[0-9]{2}.[0-9]{3}.[0-9]{3}-[0-9]{1}$";
    public const string CPF = "^[0-9]{3}.[0-9]{3}.[0-9]{3}-[0-9]{2}$";
}
